In [1]:
import pandas as pd

In [2]:
d = {'fname':['Aditya Narayan','Amit','Amit'],
    'lname':['Maurya','Patel','Vishwarkama'],
    }

In [3]:
ndf = pd.DataFrame(d)

In [4]:
ndf

            fname        lname
0  Aditya Narayan       Maurya
1            Amit        Patel
2            Amit  Vishwarkama

#### Q1. How do you load a CSV file into a Pandas DataFrame?

In [5]:
df = pd.read_csv('insurance.csv',sep=',')
df.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

#### Q2. How do you check the data type of a column in a Pandas DataFrame?

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   expenses  1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

#### Q3. How do you select rows from a Pandas DataFrame based on a condition?

In [7]:
df[df['sex']== 'female']

      age     sex   bmi  children smoker     region  expenses
0      19  female  27.9         0    yes  southwest  16884.92
5      31  female  25.7         0     no  southeast   3756.62
6      46  female  33.4         1     no  southeast   8240.59
7      37  female  27.7         3     no  northwest   7281.51
9      60  female  25.8         0     no  northwest  28923.14
...   ...     ...   ...       ...    ...        ...       ...
1332   52  female  44.7         3     no  southwest  11411.69
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

[662 rows x 7 columns]

####

####  Q4. How do you rename columns in a Pandas DataFrame?

In [8]:
ndf

            fname        lname
0  Aditya Narayan       Maurya
1            Amit        Patel
2            Amit  Vishwarkama

In [9]:
# fname -> first_name
# lname ->last_name

In [10]:
ndf.rename(columns={'fname':'first_name','lname':'last_name'},inplace=True)#ans

In [11]:
ndf

       first_name    last_name
0  Aditya Narayan       Maurya
1            Amit        Patel
2            Amit  Vishwarkama

#### Q5. How do you drop columns in a Pandas DataFrame?

In [12]:
df.drop(columns=['expenses'])

      age     sex   bmi  children smoker     region
0      19  female  27.9         0    yes  southwest
1      18    male  33.8         1     no  southeast
2      28    male  33.0         3     no  southeast
3      33    male  22.7         0     no  northwest
4      32    male  28.9         0     no  northwest
...   ...     ...   ...       ...    ...        ...
1333   50    male  31.0         3     no  northwest
1334   18  female  31.9         0     no  northeast
1335   18  female  36.9         0     no  southeast
1336   21  female  25.8         0     no  southwest
1337   61  female  29.1         0    yes  northwest

[1338 rows x 6 columns]

####

#### Q6. How do you find the unique values in a column of a Pandas DataFrame?

In [13]:
df['region'].unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

#### Q7. How do you find the number of missing values in each column of a Pandas DataFrame?

In [14]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
expenses    0
dtype: int64

#### Q8. How do you fill missing values in a Pandas DataFrame with a specific value?

In [15]:
# df.fillna(value)

#### Q9. How do you concatenate two Pandas DataFrames?

In [16]:
df1 = pd.DataFrame({'2':[x for x in range(2,21,2)]})
df2 = pd.DataFrame({'3':[x for x in range(3,31,3)]})

In [17]:
hd = pd.concat([df1,df2],axis=1)
hd

    2   3
0   2   3
1   4   6
2   6   9
3   8  12
4  10  15
5  12  18
6  14  21
7  16  24
8  18  27
9  20  30

#### Q10. How do you merge two Pandas DataFrames on a specific column?

In [18]:
df1 = pd.DataFrame({'sub':['English','Hindi','Science','social science'],'marks':[90,87,67,75]})
df2 = pd.DataFrame({
    'sub':['English','Hindi','Science','social science'],
    'Grade':["A+","A","B+","B"]}
)

In [19]:
df1

              sub  marks
0         English     90
1           Hindi     87
2         Science     67
3  social science     75

In [20]:
df2

              sub Grade
0         English    A+
1           Hindi     A
2         Science    B+
3  social science     B

In [21]:
df1.merge(df2[['sub','Grade']])

              sub  marks Grade
0         English     90    A+
1           Hindi     87     A
2         Science     67    B+
3  social science     75     B

#### Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?

In [22]:
region = df.groupby('region')

In [23]:
region.sum()

             age      bmi  children    expenses
region
northeast  12723   9453.1       339  4343668.64
northwest  12739   9490.6       373  4035711.93
southeast  14174  12142.8       382  5363689.80
southwest  12823   9943.9       371  4012754.82

In [24]:
region.min()

           age     sex   bmi  children smoker  expenses
region
northeast   18  female  16.0         0     no   1694.80
northwest   19  female  17.4         0     no   1621.34
southeast   18  female  19.8         0     no   1121.87
southwest   19  female  17.4         0     no   1241.57

#### 12.How do you pivot apandas dataframe?

#### 13. How to change the datatype of column

In [29]:
df1['marks'].astype(str)

0    90
1    87
2    67
3    75
Name: marks, dtype: object

#### 14. How do you sort a pandas dataframe by using a column

In [34]:
df.sort_values(by=['age'])

      age     sex   bmi  children smoker     region  expenses
1248   18  female  39.8         0     no  southeast   1633.96
482    18  female  31.4         0     no  southeast   1622.19
492    18  female  25.1         0     no  northeast   2196.47
525    18  female  33.9         0     no  southeast  11482.63
529    18    male  25.5         0     no  northeast   1708.00
...   ...     ...   ...       ...    ...        ...       ...
398    64    male  25.6         2     no  southwest  14988.43
335    64    male  34.5         0     no  southwest  13822.80
378    64  female  30.1         3     no  northwest  16455.71
1265   64    male  23.8         0    yes  southeast  26926.51
635    64    male  38.2         0     no  northeast  14410.93

[1338 rows x 7 columns]

#### Q15. How do you create a copy of a Pandas DataFrame?

In [35]:
new_df = df.copy()

In [36]:
new_df.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

#### Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?

In [43]:
df[(df['sex'] == 'male') & (df['region'] == 'northeast')]

      age   sex   bmi  children smoker     region  expenses
8      37  male  29.8         2     no  northeast   6406.41
10     25  male  26.2         0     no  northeast   2721.32
17     23  male  23.8         0     no  northeast   2395.17
38     35  male  36.7         1    yes  northeast  39774.28
44     38  male  37.1         1     no  northeast   6079.67
...   ...   ...   ...       ...    ...        ...       ...
1304   42  male  24.6         2    yes  northeast  21259.38
1315   18  male  28.3         1     no  northeast  11272.33
1318   35  male  39.7         4     no  northeast  19496.72
1321   62  male  26.7         0    yes  northeast  28101.33
1325   61  male  33.5         0     no  northeast  13143.34

[163 rows x 7 columns]

#### Q17. How do you calculate the mean of a column in a Pandas DataFrame?

In [42]:
df['age'].mean()

39.20702541106129

#### Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?

In [44]:
df['age'].std()

14.049960379216172

#### Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?

In [45]:
df['age'].corr(df['expenses'])

0.29900819228508274

#### Q20. How do you select specific columns in a DataFrame using their labels?

In [47]:
# df['age'] ans.

 #### Q21. How do you select specific rows in a DataFrame using their indexes?

In [48]:
df.iloc[1:5]

   age   sex   bmi  children smoker     region  expenses
1   18  male  33.8         1     no  southeast   1725.55
2   28  male  33.0         3     no  southeast   4449.46
3   33  male  22.7         0     no  northwest  21984.47
4   32  male  28.9         0     no  northwest   3866.86

#### Q22. How do you sort a DataFrame by a specific column?

In [49]:
df.sort_values(by=['age'])

      age     sex   bmi  children smoker     region  expenses
1248   18  female  39.8         0     no  southeast   1633.96
482    18  female  31.4         0     no  southeast   1622.19
492    18  female  25.1         0     no  northeast   2196.47
525    18  female  33.9         0     no  southeast  11482.63
529    18    male  25.5         0     no  northeast   1708.00
...   ...     ...   ...       ...    ...        ...       ...
398    64    male  25.6         2     no  southwest  14988.43
335    64    male  34.5         0     no  southwest  13822.80
378    64  female  30.1         3     no  northwest  16455.71
1265   64    male  23.8         0    yes  southeast  26926.51
635    64    male  38.2         0     no  northeast  14410.93

[1338 rows x 7 columns]

In [50]:
df['age_mean'] = df['age'].mean()

In [51]:
df.head(2)

   age     sex   bmi  children smoker     region  expenses   age_mean
0   19  female  27.9         0    yes  southwest  16884.92  39.207025
1   18    male  33.8         1     no  southeast   1725.55  39.207025

#### Q24. How do you remove duplicates from a DataFrame?

In [53]:
# df.drop_duplicates() ans.

#### Q25. What is the difference between .loc and .iloc in Pandas?

In [ ]:
.loc -works on labels
.i